Repository: enefry/MusicFree
Catalog: Packages/MusicFreeUI/Sources/DesignSystem/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, zh_hans

# 当前播放引擎未启用变速播放，保存的速度会在支持后生效。
source: Variable-rate playback is not enabled by the current engine. The saved rate will apply when supported.
de: Die Wiedergabe mit variabler Geschwindigkeit ist in der aktuellen Engine nicht aktiviert. Die gespeicherte Geschwindigkeit wird angewendet, sobald sie unterstützt wird.
es: El motor actual no tiene activada la reproducción a velocidad variable. La velocidad guardada se aplicará cuando sea compatible.
fr: La lecture à vitesse variable n’est pas activée par le moteur actuel. La vitesse enregistrée sera appliquée lorsqu’elle sera prise en charge.
ja: 現在のエンジンでは可変速再生が有効になっていません。対応後に保存した速度が適用されます。
zh_hans: 当前播放引擎未启用变速播放，保存的速度会在支持后生效。

# 当前播放引擎未启用均衡器，保存的均衡器设置会在支持后生效。
source: The equalizer is not enabled by the current engine. Saved equalizer settings will apply when supported.
de: Der Equalizer ist in der aktuellen Engine nicht aktiviert. Gespeicherte Equalizer-Einstellungen werden angewendet, sobald sie unterstützt werden.
es: El ecualizador no está activado por el motor actual. Los ajustes guardados se aplicarán cuando sean compatibles.
fr: L’égaliseur n’est pas activé par le moteur actuel. Les réglages enregistrés s’appliqueront lorsqu’ils seront pris en charge.
ja: 現在のエンジンではイコライザが有効になっていません。対応後に保存した設定が適用されます。
zh_hans: 当前播放引擎未启用均衡器，保存的均衡器设置会在支持后生效。

# 当前播放引擎没有提供可调频段。
source: The current playback engine provides no adjustable bands.
de: Die aktuelle Wiedergabe-Engine bietet keine einstellbaren Bänder.
es: El motor de reproducción actual no ofrece bandas ajustables.
fr: Le moteur de lecture actuel ne propose aucune bande réglable.
ja: 現在の再生エンジンには調整可能なバンドがありません。
zh_hans: 当前播放引擎没有提供可调频段。

# 当前无法导入媒体库
source: The media library is currently unavailable for import.
de: Die Mediathek ist derzeit nicht für den Import verfügbar.
es: La biblioteca musical no está disponible para importar en este momento.
fr: La bibliothèque musicale n’est pas disponible pour l’importation actuellement.
ja: 現在、メディアライブラリに読み込めません。
zh_hans: 当前无法导入媒体库

# 当前暂存：%@
source: Current staging: %@
de: Aktuelles Staging: %@
es: Preparación actual: %@
fr: Préparation actuelle : %@
ja: 現在のステージング：%@
zh_hans: 当前暂存：%@

# 当前构建未提供只读发布清单。
source: This build does not include a read-only release manifest.
de: Dieser Build enthält kein schreibgeschütztes Release-Manifest.
es: Esta compilación no incluye un manifiesto de lanzamiento de solo lectura.
fr: Cette version ne contient pas de manifeste de publication en lecture seule.
ja: このビルドには読み取り専用のリリースマニフェストが含まれていません。
zh_hans: 当前构建未提供只读发布清单。

# 当前构建没有可用的连接能力。
source: Connection capability is unavailable in this build.
de: In diesem Build ist keine Verbindungsfunktion verfügbar.
es: Esta compilación no tiene capacidad de conexión disponible.
fr: Cette version ne dispose d’aucune capacité de connexion.
ja: このビルドでは接続機能を利用できません。
zh_hans: 当前构建没有可用的连接能力。

# 当前歌曲尚未形成历史记录
source: The current song has not formed a history record
de: Für den aktuellen Song gibt es noch keinen Verlaufseintrag
es: La canción actual aún no tiene un registro en el historial
fr: La chanson actuelle n’a pas encore d’entrée dans l’historique
ja: 現在の曲には履歴記録がありません
zh_hans: 当前歌曲尚未形成历史记录

# 当前没有封面
source: There is no current artwork
de: Kein aktuelles Cover
es: No hay portada actual
fr: Aucune pochette actuelle
ja: 現在のアートワークはありません
zh_hans: 当前没有封面

# 当前没有播放内容
source: Nothing is playing
de: Nichts wird wiedergegeben
es: No se está reproduciendo nada
fr: Aucun élément en lecture
ja: 再生中の項目はありません
zh_hans: 当前没有播放内容

# 当前版本不可用
source: Unavailable in the current version
de: In der aktuellen Version nicht verfügbar
es: No disponible en la versión actual
fr: Indisponible dans la version actuelle
ja: 現在のバージョンでは利用できません
zh_hans: 当前版本不可用

# 当前版本对相同内容统一跳过导入；替换和保留重复副本尚未接入。
source: This version always skips identical content during import; replace and keep-duplicate options are not connected yet.
de: Diese Version überspringt beim Import immer identische Inhalte; Ersetzen und doppelte Kopien behalten sind noch nicht verfügbar.
es: Esta versión omite siempre el contenido idéntico al importar; las opciones de reemplazar y conservar duplicados aún no están disponibles.
fr: Cette version ignore toujours les contenus identiques lors de l’importation ; les options de remplacement et de conservation des doublons ne sont pas encore disponibles.
ja: このバージョンでは同じ内容のインポートを常にスキップします。置き換えと重複コピーの保持にはまだ対応していません。
zh_hans: 当前版本对相同内容统一跳过导入；替换和保留重复副本尚未接入。

# 当前版本暂不支持 AirPlay 输出。
source: AirPlay output is not supported in this version.
de: Die AirPlay-Ausgabe wird in dieser Version nicht unterstützt.
es: Esta versión no admite la salida AirPlay.
fr: La sortie AirPlay n’est pas prise en charge dans cette version.
ja: このバージョンではAirPlay出力に対応していません。
zh_hans: 当前版本暂不支持 AirPlay 输出。

# 当前版本暂不支持此在线源。
source: This online source is not supported in the current version.
de: Diese Online-Quelle wird von der aktuellen Version nicht unterstützt.
es: Esta fuente en línea no es compatible con la versión actual.
fr: Cette source en ligne n’est pas prise en charge par la version actuelle.
ja: 現在のバージョンではこのオンラインソースに対応していません。
zh_hans: 当前版本暂不支持此在线源。

# 当前目录
source: Current directory
de: Aktuelles Verzeichnis
es: Directorio actual
fr: Répertoire actuel
ja: 現在のディレクトリ
zh_hans: 当前目录

# 当前目录 · 使用右上角导入
source: Current directory · Use Import in the upper right
de: Aktuelles Verzeichnis · Importieren oben rechts verwenden
es: Directorio actual · Usa Importar arriba a la derecha
fr: Répertoire actuel · Utilisez Importer en haut à droite
ja: 現在のディレクトリ · 右上の「読み込む」を使用
zh_hans: 当前目录 · 使用右上角导入

# 当前系统不支持 MusicKit 元数据补充。
source: MusicKit metadata enrichment is not supported on this system.
de: Die Anreicherung von Metadaten mit MusicKit wird auf diesem System nicht unterstützt.
es: Este sistema no admite el enriquecimiento de metadatos con MusicKit.
fr: L’enrichissement des métadonnées avec MusicKit n’est pas pris en charge sur ce système.
ja: このシステムではMusicKitのメタデータ補完に対応していません。
zh_hans: 当前系统不支持 MusicKit 元数据补充。

# 当前设备不支持切换应用图标。
source: App icon switching is not supported on this device.
de: Das Wechseln des App-Symbols wird auf diesem Gerät nicht unterstützt.
es: Este dispositivo no admite cambiar el icono de la app.
fr: Le changement d’icône de l’app n’est pas pris en charge sur cet appareil.
ja: このデバイスではアプリアイコンの切り替えに対応していません。
zh_hans: 当前设备不支持切换应用图标。

# 当前设备限制使用 Apple Music catalog。
source: This device restricts Apple Music catalog access.
de: Dieses Gerät beschränkt den Zugriff auf den Apple-Music-Katalog.
es: Este dispositivo restringe el acceso al catálogo de Apple Music.
fr: Cet appareil restreint l’accès au catalogue Apple Music.
ja: このデバイスではApple Musicカタログの利用が制限されています。
zh_hans: 当前设备限制使用 Apple Music catalog。

# 当前隔离：%@
source: Current quarantine: %@
de: Aktuelle Quarantäne: %@
es: Cuarentena actual: %@
fr: Quarantaine actuelle : %@
ja: 現在の隔離：%@
zh_hans: 当前隔离：%@

# 当前音频源没有可显示的歌词。
source: The current audio source has no lyrics to display.
de: Die aktuelle Audioquelle enthält keinen anzeigbaren Liedtext.
es: La fuente de audio actual no tiene letras para mostrar.
fr: La source audio actuelle ne contient aucune parole à afficher.
ja: 現在の音声ソースには表示できる歌詞がありません。
zh_hans: 当前音频源没有可显示的歌词。

# 当前页面所需的目录浏览能力不可用。
source: The directory-browsing capability required by this page is unavailable.
de: Die für diese Seite erforderliche Verzeichnisfunktion ist nicht verfügbar.
es: La función de exploración de directorios necesaria en esta página no está disponible.
fr: La fonction de navigation dans les répertoires requise par cette page est indisponible.
ja: このページに必要なディレクトリ表示機能を利用できません。
zh_hans: 当前页面所需的目录浏览能力不可用。

# 待删除项目会逐项核对；可恢复或可完成的事务会被处理，仍无法判断的事务会保留。
source: Pending removals are checked one by one; recoverable or completable transactions are handled, while unresolved transactions remain.
de: Ausstehende Löschungen werden einzeln geprüft; wiederherstellbare oder abschließbare Vorgänge werden bearbeitet, unklare Vorgänge bleiben erhalten.
es: Las eliminaciones pendientes se comprueban una a una; se procesan las transacciones recuperables o finalizables y se conservan las que siguen sin determinar.
fr: Les suppressions en attente sont vérifiées une par une ; les transactions récupérables ou finalisables sont traitées, tandis que celles qui restent indéterminées sont conservées.
ja: 保留中の削除項目を1件ずつ確認し、復元または完了できる処理を実行します。判断できない処理は残します。
zh_hans: 待删除项目会逐项核对；可恢复或可完成的事务会被处理，仍无法判断的事务会保留。

# 待同意
source: Awaiting consent
de: Wartet auf Zustimmung
es: Esperando consentimiento
fr: En attente de consentement
ja: 同意待ち
zh_hans: 待同意

# 待播放引擎支持
source: Waiting for playback engine support
de: Warten auf Unterstützung durch die Wiedergabe-Engine
es: Esperando la compatibilidad del motor de reproducción
fr: En attente de la prise en charge par le moteur de lecture
ja: 再生エンジンの対応を待っています
zh_hans: 待播放引擎支持

# 待支持
source: Pending support
de: Unterstützung ausstehend
es: Compatibilidad pendiente
fr: Prise en charge en attente
ja: 対応待ち
zh_hans: 待支持

# 总开关控制在线源服务；每个来源还可以独立启用或关闭。已经导入本地的媒体不受影响。
source: The master switch controls the online-source service; each source can also be enabled or disabled independently. Media already imported locally is unaffected.
de: Der Hauptschalter steuert den Online-Quellendienst; jede Quelle kann zusätzlich unabhängig aktiviert oder deaktiviert werden. Bereits lokal importierte Medien bleiben unverändert.
es: El interruptor general controla el servicio de fuentes en línea; cada fuente también se puede activar o desactivar de forma independiente. El contenido ya importado localmente no se ve afectado.
fr: L’interrupteur général contrôle le service de sources en ligne ; chaque source peut également être activée ou désactivée indépendamment. Les médias déjà importés localement ne sont pas affectés.
ja: 全体スイッチでオンラインソースサービスを制御します。各ソースは個別にオン・オフできます。すでにローカルへ読み込んだメディアには影響しません。
zh_hans: 总开关控制在线源服务；每个来源还可以独立启用或关闭。已经导入本地的媒体不受影响。

# 恢复设置
source: Restore settings
de: Einstellungen wiederherstellen
es: Restaurar ajustes
fr: Restaurer les réglages
ja: 設定を復元
zh_hans: 恢复设置

# 恢复默认设置
source: Restore defaults
de: Standardeinstellungen wiederherstellen
es: Restaurar valores por defecto
fr: Rétablir les valeurs par défaut
ja: デフォルトに戻す
zh_hans: 恢复默认设置

# 恢复默认设置？
source: Restore default settings?
de: Standardeinstellungen wiederherstellen?
es: ¿Restaurar los ajustes por defecto?
fr: Rétablir les réglages par défaut ?
ja: デフォルト設定に戻しますか？
zh_hans: 恢复默认设置？

# 所有在线源下载与导入已取消
source: All online-source downloads and imports canceled
de: Alle Downloads und Importe von Online-Quellen abgebrochen
es: Se cancelaron todas las descargas e importaciones de fuentes en línea
fr: Tous les téléchargements et importations de sources en ligne ont été annulés
ja: すべてのオンラインソースのダウンロードと読み込みをキャンセルしました
zh_hans: 所有在线源下载与导入已取消

# 所有音乐
source: All Music
de: Alle Musik
es: Toda la música
fr: Toute la musique
ja: すべての音楽
zh_hans: 所有音乐

# 手写
source: Script
de: Handschrift
es: Escritura
fr: Écriture
ja: スクリプト
zh_hans: 手写

# 打开%@
source: Open %@
de: %@ öffnen
es: Abrir %@
fr: Ouvrir %@
ja: %@を開く
zh_hans: 打开%@

# 打开专辑
source: Open album
de: Album öffnen
es: Abrir álbum
fr: Ouvrir l’album
ja: アルバムを開く
zh_hans: 打开专辑

# 打开专辑，按住显示播放队列操作
source: Open album. Press and hold for queue actions
de: Album öffnen. Gedrückt halten, um Warteschlangenaktionen anzuzeigen
es: Abrir álbum. Mantén pulsado para ver las acciones de la cola
fr: Ouvrir l’album. Maintenez le doigt appuyé pour afficher les actions de la file d’attente
ja: アルバムを開きます。長押しするとキューの操作を表示します
zh_hans: 打开专辑，按住显示播放队列操作

# 打开播放队列
source: Open play queue
de: Wiedergabewarteschlange öffnen
es: Abrir cola de reproducción
fr: Ouvrir la file d’attente
ja: 再生キューを開く
zh_hans: 打开播放队列

# 打开播放页歌词时按需在线获取，成功后保存到本地资料库。
source: Fetch lyrics on demand from LRCLIB when the player lyrics page opens. Successful results are saved to the local library.
de: Liedtexte werden beim Öffnen der Liedtextseite des Players bei Bedarf von LRCLIB abgerufen. Erfolgreiche Ergebnisse werden in der lokalen Mediathek gespeichert.
es: Obtén letras bajo demanda desde LRCLIB al abrir la página de letras del reproductor. Los resultados obtenidos se guardan en la biblioteca local.
fr: Récupère les paroles à la demande depuis LRCLIB à l’ouverture de la page des paroles du lecteur. Les résultats obtenus sont enregistrés dans la bibliothèque locale.
ja: プレーヤーの歌詞ページを開いたときに、LRCLIBから必要に応じて歌詞を取得します。取得に成功した歌詞はローカルライブラリに保存されます。
zh_hans: 打开播放页歌词时按需在线获取，成功后保存到本地资料库。

# 打开文件夹，按住显示播放队列操作
source: Open folder. Press and hold for queue actions
de: Ordner öffnen. Gedrückt halten, um Warteschlangenaktionen anzuzeigen
es: Abrir carpeta. Mantén pulsado para ver las acciones de la cola
fr: Ouvrir le dossier. Maintenez le doigt appuyé pour afficher les actions de la file d’attente
ja: フォルダを開きます。長押しするとキューの操作を表示します
zh_hans: 打开文件夹，按住显示播放队列操作

# 打开正在播放
source: Open Now Playing
de: Aktuellen Titel öffnen
es: Abrir reproducción actual
fr: Ouvrir la lecture en cours
ja: 再生中を開く
zh_hans: 打开正在播放

# 打开流派，按住显示播放队列操作
source: Open genre. Press and hold for queue actions
de: Genre öffnen. Gedrückt halten, um Warteschlangenaktionen anzuzeigen
es: Abrir género. Mantén pulsado para ver las acciones de la cola
fr: Ouvrir le genre. Maintenez le doigt appuyé pour afficher les actions de la file d’attente
ja: ジャンルを開きます。長押しするとキューの操作を表示します
zh_hans: 打开流派，按住显示播放队列操作

# 打开艺人，按住显示播放队列操作
source: Open artist. Press and hold for queue actions
de: Interpret öffnen. Gedrückt halten, um Warteschlangenaktionen anzuzeigen
es: Abrir artista. Mantén pulsado para ver las acciones de la cola
fr: Ouvrir l’artiste. Maintenez le doigt appuyé pour afficher les actions de la file d’attente
ja: アーティストを開きます。長押しするとキューの操作を表示します
zh_hans: 打开艺人，按住显示播放队列操作

# 执行存储维护？
source: Perform storage maintenance?
de: Speicherwartung durchführen?
es: ¿Realizar el mantenimiento del almacenamiento?
fr: Effectuer la maintenance du stockage ?
ja: ストレージのメンテナンスを実行しますか？
zh_hans: 执行存储维护？

# 扫描并补充
source: Scan and enrich
de: Scannen und ergänzen
es: Analizar y completar
fr: Analyser et compléter
ja: スキャンして補完
zh_hans: 扫描并补充

# 扫描未完成，请稍后重试。
source: The scan did not finish. Try again later.
de: Der Scan wurde nicht abgeschlossen. Versuchen Sie es später erneut.
es: El análisis no terminó. Inténtalo de nuevo más tarde.
fr: L’analyse n’est pas terminée. Réessayez plus tard.
ja: スキャンが完了しませんでした。後でもう一度お試しください。
zh_hans: 扫描未完成，请稍后重试。

# 找不到歌曲
source: Song not found
de: Song nicht gefunden
es: No se encontró la canción
fr: Chanson introuvable
ja: 曲が見つかりません
zh_hans: 找不到歌曲

# 技术详情
source: Technical details
de: Technische Details
es: Detalles técnicos
fr: Détails techniques
ja: 技術詳細
zh_hans: 技术详情

# 拖动调整播放位置
source: Drag to adjust playback position
de: Ziehen, um die Wiedergabeposition anzupassen
es: Arrastra para ajustar la posición de reproducción
fr: Faites glisser pour ajuster la position de lecture
ja: ドラッグして再生位置を調整
zh_hans: 拖动调整播放位置

# 按专辑浏览
source: Browse by Album
de: Nach Alben durchsuchen
es: Explorar por álbum
fr: Parcourir par album
ja: アルバム別に閲覧
zh_hans: 按专辑浏览

# 按启用顺序依次匹配；成功后停止。已有本地信息不会覆盖。
source: Sources are tried in enabled order and stop after a match. Existing local information is kept.
de: Die aktivierten Quellen werden der Reihe nach verwendet und nach einem Treffer beendet. Vorhandene lokale Informationen bleiben erhalten.
es: Las fuentes se prueban en el orden activado y se detienen al encontrar una coincidencia. Se conserva la información local existente.
fr: Les sources sont utilisées dans l’ordre activé et s’arrêtent après une correspondance. Les informations locales existantes sont conservées.
ja: 有効にした順にソースを試し、一致すると停止します。既存のローカル情報は保持されます。
zh_hans: 按启用顺序依次匹配；成功后停止。已有本地信息不会覆盖。

# 按启用顺序匹配歌词；播放页按需获取并保存，预下载只处理没有本地歌词的歌曲。
source: Lyrics are matched in enabled order. Player pages fetch and save them on demand; pre-download only processes songs without local lyrics.
de: Liedtexte werden in der aktivierten Reihenfolge gesucht. Die Wiedergabeseite lädt sie bei Bedarf und speichert sie; der Vorab-Download verarbeitet nur Titel ohne lokale Liedtexte.
es: Las letras se buscan en el orden activado. La página del reproductor las obtiene y guarda cuando es necesario; la predescarga solo procesa canciones sin letras locales.
fr: Les paroles sont recherchées dans l’ordre activé. La page du lecteur les récupère et les enregistre à la demande ; le pré-téléchargement ne traite que les titres sans paroles locales.
ja: 歌詞は有効にした順に検索します。再生ページでは必要に応じて取得して保存し、先行ダウンロードではローカル歌詞がない曲だけを処理します。
zh_hans: 按启用顺序匹配歌词；播放页按需获取并保存，预下载只处理没有本地歌词的歌曲。

# 按大小滚动，最多保留当前文件和 1 个归档文件。
source: Logs roll by size, keeping the active file and one archived file.
de: Protokolle werden nach Größe rotiert; die aktive Datei und eine archivierte Datei bleiben erhalten.
es: Los registros rotan por tamaño y conservan el archivo activo y un archivo archivado.
fr: Les journaux sont renouvelés selon leur taille, avec le fichier actif et un seul fichier archivé conservés.
ja: ログはサイズでローテーションされ、アクティブファイルとアーカイブファイル1つが保持されます。
zh_hans: 按大小滚动，最多保留当前文件和 1 个归档文件。

# 按文件夹导入本地音频后会显示在这里。
source: Local audio imported by folder will appear here.
de: Hier werden nach Ordner importierte lokale Audiodateien angezeigt.
es: El audio local importado por carpeta aparecerá aquí.
fr: Les fichiers audio locaux importés par dossier s’afficheront ici.
ja: フォルダから読み込んだ音声がここに表示されます。
zh_hans: 按文件夹导入本地音频后会显示在这里。

# 按文件夹浏览
source: Browse by Folder
de: Nach Ordnern durchsuchen
es: Explorar por carpeta
fr: Parcourir par dossier
ja: フォルダ別に閲覧
zh_hans: 按文件夹浏览

# 按艺人浏览
source: Browse by Artist
de: Nach Künstlern durchsuchen
es: Explorar por artista
fr: Parcourir par artiste
ja: アーティスト別に閲覧
zh_hans: 按艺人浏览

# 授权后浏览云端目录并导入媒体库
source: Authorize to browse cloud directories and import into the media library
de: Nach der Autorisierung Cloud-Verzeichnisse durchsuchen und in die Mediathek importieren
es: Autoriza para explorar directorios en la nube e importar a la biblioteca
fr: Autorisez l’accès pour parcourir les répertoires cloud et importer dans la bibliothèque
ja: 認証後にクラウドディレクトリを表示し、メディアライブラリに読み込みます
zh_hans: 授权后浏览云端目录并导入媒体库

# 排序
source: Sort
de: Sortieren
es: Ordenar
fr: Trier
ja: 並べ替え
zh_hans: 排序

# 排序专辑
source: Sort albums
de: Alben sortieren
es: Ordenar álbumes
fr: Trier les albums
ja: アルバムを並べ替え
zh_hans: 排序专辑

# 排序方式
source: Sort By
de: Sortieren nach
es: Ordenar por
fr: Trier par
ja: 並べ替え
zh_hans: 排序方式

# 排序歌曲
source: Sort songs
de: Songs sortieren
es: Ordenar canciones
fr: Trier les chansons
ja: 曲を並べ替え
zh_hans: 排序歌曲

# 提供元数据或歌词服务。
source: Provide metadata or lyrics services.
de: Bietet Metadaten- oder Liedtextdienste.
es: Proporciona servicios de metadatos o letras.
fr: Fournit des services de métadonnées ou de paroles.
ja: メタデータまたは歌詞サービスを提供します。
zh_hans: 提供元数据或歌词服务。

# 提前 250 毫秒
source: Advance by 250 ms
de: Um 250 ms vorziehen
es: Adelantar 250 ms
fr: Avancer de 250 ms
ja: 250ミリ秒早める
zh_hans: 提前 250 毫秒

# 搜索%@
source: Search %@
de: %@ suchen
es: Buscar %@
fr: Rechercher %@
ja: %@を検索
zh_hans: 搜索%@

# 搜索当前目录
source: Search this directory
de: Dieses Verzeichnis durchsuchen
es: Buscar en este directorio
fr: Rechercher dans ce répertoire
ja: このディレクトリを検索
zh_hans: 搜索当前目录

# 搜索播放列表
source: Search playlists
de: Wiedergabelisten suchen
es: Buscar listas
fr: Rechercher des playlists
ja: プレイリストを検索
zh_hans: 搜索播放列表

# 搜索歌曲
source: Search songs
de: Titel suchen
es: Buscar canciones
fr: Rechercher des morceaux
ja: 曲を検索
zh_hans: 搜索歌曲

# 搜索歌曲、专辑或艺人
source: Search songs, albums, or artists
de: Songs, Alben oder Interpreten suchen
es: Buscar canciones, álbumes o artistas
fr: Rechercher des chansons, des albums ou des artistes
ja: 曲、アルバム、アーティストを検索
zh_hans: 搜索歌曲、专辑或艺人

# 撤回
source: Withdraw
de: Widerrufen
es: Retirar
fr: Retirer
ja: 撤回
zh_hans: 撤回

# 撤回同意并关闭联网服务
source: Withdraw consent and disable online services
de: Zustimmung widerrufen und Onlinedienste deaktivieren
es: Retirar el consentimiento y desactivar los servicios en línea
fr: Retirer le consentement et désactiver les services en ligne
ja: 同意を撤回してオンラインサービスを無効化
zh_hans: 撤回同意并关闭联网服务

# 撤回并关闭所有在线源
source: Revoke and disable all online sources
de: Zustimmung widerrufen und alle Online-Quellen deaktivieren
es: Revocar y desactivar todas las fuentes en línea
fr: Révoquer et désactiver toutes les sources en ligne
ja: すべてのオンラインソースの同意を撤回して無効化
zh_hans: 撤回并关闭所有在线源

# 撤回应用隐私政策？
source: Revoke app privacy consent?
de: Zustimmung zur Datenschutzerklärung der App widerrufen?
es: ¿Revocar el consentimiento de privacidad de la aplicación?
fr: Révoquer le consentement à la politique de confidentialité de l’application ?
ja: アプリのプライバシー同意を撤回しますか？
zh_hans: 撤回应用隐私政策？

# 撤销“(currentConfiguration.displayName)”后会停止此来源的新请求并清除来源级同意；已经导入本地的媒体不会删除。
source: After revoking “\(currentConfiguration.displayName)”, new requests for this source will stop and source-level consent will be cleared; locally imported media will not be deleted.
de: Nach dem Widerruf von „\(currentConfiguration.displayName)“ werden neue Anfragen für diese Quelle gestoppt und die Zustimmung auf Quellenebene gelöscht; lokal importierte Medien werden nicht gelöscht.
es: Después de revocar “\(currentConfiguration.displayName)”, se detendrán las nuevas solicitudes de esta fuente y se eliminará el consentimiento de la fuente; el contenido importado localmente no se borrará.
fr: Après révocation de « \(currentConfiguration.displayName) », les nouvelles requêtes de cette source seront interrompues et le consentement au niveau de la source sera supprimé ; les médias importés localement ne seront pas supprimés.
ja: 「\(currentConfiguration.displayName)」の同意を撤回すると、このソースへの新しいリクエストを停止し、ソース単位の同意を削除します。ローカルに読み込んだメディアは削除されません。
zh_hans: 撤销“\(currentConfiguration.displayName)”后会停止此来源的新请求并清除来源级同意；已经导入本地的媒体不会删除。

# 撤销同意
source: Revoke consent
de: Einwilligung widerrufen
es: Revocar consentimiento
fr: Révoquer le consentement
ja: 同意を撤回
zh_hans: 撤销同意

# 撤销后立即停止此来源的新请求并清除来源级同意；已经导入本地的媒体不会删除。
source: Revoking will immediately stop new requests for this source and clear source-level consent; locally imported media will not be deleted.
de: Durch den Widerruf werden neue Anfragen für diese Quelle sofort gestoppt und die Zustimmung auf Quellenebene gelöscht; lokal importierte Medien werden nicht gelöscht.
es: Al revocar, se detendrán inmediatamente las nuevas solicitudes de esta fuente y se eliminará el consentimiento; el contenido importado localmente no se borrará.
fr: La révocation arrête immédiatement les nouvelles requêtes de cette source et supprime le consentement au niveau de la source ; les médias importés localement ne seront pas supprimés.
ja: 撤回すると、このソースへの新しいリクエストを直ちに停止し、ソース単位の同意を削除します。ローカルに読み込んだメディアは削除されません。
zh_hans: 撤销后立即停止此来源的新请求并清除来源级同意；已经导入本地的媒体不会删除。

# 撤销并停用
source: Revoke and disable
de: Widerrufen und deaktivieren
es: Revocar y desactivar
fr: Révoquer et désactiver
ja: 同意を撤回して無効化
zh_hans: 撤销并停用

# 撤销并停用此来源
source: Revoke consent and disable this source
de: Zustimmung widerrufen und diese Quelle deaktivieren
es: Revocar el consentimiento y desactivar esta fuente
fr: Révoquer le consentement et désactiver cette source
ja: このソースの同意を撤回して無効化
zh_hans: 撤销并停用此来源

# 撤销来源隐私协议？
source: Revoke source privacy consent?
de: Zustimmung zur Datenschutzerklärung der Quelle widerrufen?
es: ¿Revocar el consentimiento de privacidad de la fuente?
fr: Révoquer le consentement à la politique de confidentialité de la source ?
ja: ソースのプライバシー同意を撤回しますか？
zh_hans: 撤销来源隐私协议？

# 撤销此来源隐私协议？
source: Revoke this source's privacy consent?
de: Einwilligung zur Datenschutzerklärung dieser Quelle widerrufen?
es: ¿Revocar el consentimiento de privacidad de esta fuente?
fr: Révoquer le consentement relatif à la confidentialité de cette source ?
ja: このソースのプライバシー同意を撤回しますか？
zh_hans: 撤销此来源隐私协议？

# 播放
source: Play
de: Abspielen
es: Reproducir
fr: Lire
ja: 再生
zh_hans: 播放
